<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.gingerscripting.firefox.jamf</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Apps</string>
		<key>NAME</key>
		<string>Firefox</string>
		<key>POLICY_CATEGORY</key>
		<string>Master App Installs</string>
		<key>POLICY_NAME</key>
		<string>Firefox install</string>
		<key>POLICY_TEMPLATE</key>
		<string>JamfPolicyTemplate.xml</string>
		<key>UPDATE_PREDICATE</key>
		<string>pkg_uploaded == False</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.rtrouton.pkg.Firefox</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category_name</key>
				<string>%CATEGORY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_category</key>
				<string>%CATEGORY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>%UPDATE_PREDICATE%</string>
			</dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
		</dict>
	</array>
</dict>
</plist>
